WELCOME = ('Привет👋\nЯ - PnevmoStats, бот который поможет тебе визуализировать'
           ' плато и точнее настроить расход.\nПосле нажатия кнопки \'Начать'
           ' пристрелку\'  ты сможешь вводить значения выстрела. А далее '
           'будет сформирован удобный график с необходимым параметрами.\n'
           'Пример на фото:')


BUTTON_START_SHOOTING = 'Начать пристрелку'
BUTTON_CONTINUE_SHOOTING = '🏹 Продолжить'
BUTTON_STOP_SHOOTING = '⛔️ Закончить'

PRESSURE_SAVE_START = '✏️ Введите давление (целое число). Давление НЕ МОЖЕТ повторятся!'
SPEED_SAVE_START = '✏️ Введите скорость пульки: '

PRESSURE_ERROR = 'Указанное вами давление не является целым числом!'
SPEED_ERROR = 'Указанная вами давление не является числом!'
ERROR_CHOOSE_ACTION = '😔 Я вас не понял, выберите действие заново'

SAVE_SUCCESS = '✅ Данные успешно сохранены!'

REVERSE_GRAPH = ('Перевернуть график (по умолчанию, давление идёт по'
                 ' возрастающей, если график перевернуть, то давление пойдёт'
                 'по убывающей)')

REVERSE_YES = 'Оставить по умолчанию'
REVERSE_NO = 'Перевернуть'

GRAPH_START = '⚙️ График формируется...'
GRAPH_END = '📈 Формирование графика завершено!'
